<?php

return [
    'tools' => [
        'export_import_data' => 'Εξαγωγή/Εισαγωγή δεδομένων',
    ],

    'import' => [
        'name' => 'Εισαγωγή',
        'heading' => 'Εισαγωγή :label',
        'failed_to_read_file' => 'Το αρχείο είναι μη έγκυρο, κατεστραμμένο ή πολύ μεγάλο για ανάγνωση.',

        'form' => [
            'quick_export_message' => 'Εάν θέλετε να εξαγάγετε δεδομένα :label, μπορείτε να το κάνετε γρήγορα κάνοντας κλικ στο :export_csv_link ή :export_excel_link.',
            'quick_export_button' => 'Εξαγωγή σε :format',
            'dropzone_message' => 'Σύρετε και αποθέστε το αρχείο εδώ ή κάντε κλικ για μεταφόρτωση',
            'allowed_extensions' => 'Επιλέξτε ένα αρχείο με τις ακόλουθες επεκτάσεις: :extensions.',
            'import_button' => 'Εισαγωγή',
            'chunk_size' => 'Μέγεθος τμήματος',
            'chunk_size_helper' => 'Ο αριθμός των γραμμών που θα εισαχθούν ταυτόχρονα ορίζεται από το μέγεθος του τμήματος. Αυξήστε αυτήν την τιμή εάν έχετε ένα μεγάλο αρχείο και τα δεδομένα εισάγονται πολύ γρήγορα. Μειώστε αυτήν την τιμή εάν αντιμετωπίσετε όρια μνήμης ή προβλήματα χρονικού ορίου πύλης κατά την εισαγωγή δεδομένων.',
        ],

        'failures' => [
            'title' => 'Αποτυχίες',
            'attribute' => 'Χαρακτηριστικό',
            'errors' => 'Σφάλματα',
        ],

        'example' => [
            'title' => 'Παράδειγμα',
            'download' => 'Λήψη παραδείγματος αρχείου :type',
        ],

        'rules' => [
            'title' => 'Κανόνες',
            'column' => 'Στήλη',
        ],

        'uploading_message' => 'Έναρξη μεταφόρτωσης αρχείου...',
        'uploaded_message' => 'Το αρχείο :file έχει μεταφορτωθεί με επιτυχία. Έναρξη επικύρωσης δεδομένων...',
        'validating_message' => 'Επικύρωση από :from έως :to...',
        'importing_message' => 'Εισαγωγή από :from έως :to...',
        'done_message' => 'Εισήχθησαν με επιτυχία :count :label.',
        'validating_failed_message' => 'Η επικύρωση απέτυχε. Ελέγξτε τα σφάλματα παρακάτω.',
        'no_data_message' => 'Τα δεδομένα σας είναι ήδη ενημερωμένα ή δεν υπάρχουν δεδομένα για εισαγωγή.',
    ],

    'export' => [
        'name' => 'Εξαγωγή',
        'heading' => 'Εξαγωγή :label',
        'excel_not_supported_for_large_exports' => 'Η μορφή Excel δεν υποστηρίζεται για μεγάλες εξαγωγές (:count στοιχεία). Χρησιμοποιήστε τη μορφή CSV για καλύτερη απόδοση και αξιοπιστία.',

        'form' => [
            'all_columns_disabled' => 'Θα εξαχθούν οι ακόλουθες στήλες: :columns.',
            'columns' => 'Στήλες',
            'format' => 'Μορφή',
            'export_button' => 'Εξαγωγή',
        ],

        'success_message' => 'Εξήχθη με επιτυχία.',
        'error_message' => 'Η εξαγωγή απέτυχε.',

        'empty_state' => [
            'title' => 'Δεν υπάρχουν δεδομένα για εξαγωγή',
            'description' => 'Φαίνεται ότι δεν υπάρχουν δεδομένα για εξαγωγή.',
            'back' => 'Επιστροφή στο :page',
        ],
    ],
    'check_all' => 'Επιλογή όλων',
];
