<?php

return [
    'tools' => [
        'export_import_data' => 'Експорт/Импорт на данни',
    ],

    'import' => [
        'name' => 'Импорт',
        'heading' => 'Импорт :label',
        'failed_to_read_file' => 'Файлът е невалиден, повреден или твърде голям за четене.',

        'form' => [
            'quick_export_message' => 'Ако искате да експортирате данни за :label, можете да го направите бързо, като кликнете върху :export_csv_link или :export_excel_link.',
            'quick_export_button' => 'Експорт към :format',
            'dropzone_message' => 'Плъзнете и пуснете файл тук или кликнете за качване',
            'allowed_extensions' => 'Изберете файл със следните разширения: :extensions.',
            'import_button' => 'Импорт',
            'chunk_size' => 'Размер на парчето',
            'chunk_size_helper' => 'Броят на редовете, които да бъдат импортирани наведнъж, се определя от размера на парчето. Увеличете тази стойност, ако имате голям файл и данните се импортират много бързо. Намалете тази стойност, ако срещнете ограничения на паметта или проблеми с изтичане на времето на шлюза при импортиране на данни.',
        ],

        'failures' => [
            'title' => 'Неуспехи',
            'attribute' => 'Атрибут',
            'errors' => 'Грешки',
        ],

        'example' => [
            'title' => 'Пример',
            'download' => 'Изтегляне на примерен :type файл',
        ],

        'rules' => [
            'title' => 'Правила',
            'column' => 'Колона',
        ],

        'uploading_message' => 'Започване на качване на файл...',
        'uploaded_message' => 'Файлът :file е качен успешно. Започване на валидиране на данните...',
        'validating_message' => 'Валидиране от :from до :to...',
        'importing_message' => 'Импортиране от :from до :to...',
        'done_message' => 'Импортирани успешно :count :label.',
        'validating_failed_message' => 'Валидирането неуспешно. Моля, проверете грешките по-долу.',
        'no_data_message' => 'Вашите данни вече са актуални или няма данни за импортиране.',
    ],

    'export' => [
        'name' => 'Експорт',
        'heading' => 'Експорт :label',
        'excel_not_supported_for_large_exports' => 'Excel форматът не се поддържа за големи експорти (:count елемента). Моля, използвайте CSV формат вместо това за по-добра производителност и надеждност.',

        'form' => [
            'all_columns_disabled' => 'Следните колони ще бъдат експортирани: :columns.',
            'columns' => 'Колони',
            'format' => 'Формат',
            'export_button' => 'Експорт',
        ],

        'success_message' => 'Експортирано успешно.',
        'error_message' => 'Експортът неуспешен.',

        'empty_state' => [
            'title' => 'Няма данни за експорт',
            'description' => 'Изглежда, че няма данни за експортиране.',
            'back' => 'Назад към :page',
        ],
    ],
    'check_all' => 'Маркирай всички',
];
