<?php

return [
    'tools' => [
        'export_import_data' => 'მონაცემების ექსპორტი/იმპორტი',
    ],

    'import' => [
        'name' => 'იმპორტი',
        'heading' => ':label იმპორტი',
        'failed_to_read_file' => 'ფაილი არასწორია, დაზიანებულია ან ძალიან დიდია წასაკითხად.',

        'form' => [
            'quick_export_message' => 'თუ გსურთ :label მონაცემების ექსპორტი, შეგიძლიათ სწრафად გააკეთოთ ეს :export_csv_link ან :export_excel_link-ზე დაწკაპუნებით.',
            'quick_export_button' => 'ექსპორტი :format-ში',
            'dropzone_message' => 'გადმოიტანეთ და ჩამოაგდეთ ფაილი აქ ან დააწკაპუნეთ ატვირთვისთვის',
            'allowed_extensions' => 'აირჩიეთ ფაილი შემდეგი გაფართოებებით: :extensions.',
            'import_button' => 'იმპორტი',
            'chunk_size' => 'ნაწილის ზომა',
            'chunk_size_helper' => 'ერთდროულად იმპორტირებული სტრიქონების რაოდენობა განისაზღვრება ნაწილის ზომით. გაზარდეთ ეს მნიშვნელობა, თუ გაქვთ დიდი ფაილი და მონაცემები ძალიან სწრაფად იმპორტირდება. შეამცირეთ ეს მნიშვნელობა, თუ შეხვდებით მეხსიერების შეზღუდვებს ან გეითვეის ვადის გასვლის პრობლემებს მონაცემების იმპორტისას.',
        ],

        'failures' => [
            'title' => 'წარუმატებლობები',
            'attribute' => 'ატრიბუტი',
            'errors' => 'შეცდომები',
        ],

        'example' => [
            'title' => 'მაგალითი',
            'download' => 'ჩამოტვირთეთ მაგალითის :type ფაილი',
        ],

        'rules' => [
            'title' => 'წესები',
            'column' => 'სვეტი',
        ],

        'uploading_message' => 'ფაილის ატვირთვის დაწყება...',
        'uploaded_message' => 'ფაილი :file წარმატებით აიტვირთა. მონაცემების ვალიდაციის დაწყება...',
        'validating_message' => 'ვალიდაცია :from-დან :to-მდე...',
        'importing_message' => 'იმპორტი :from-დან :to-მდე...',
        'done_message' => 'წარმატებით იმპორტირდა :count :label.',
        'validating_failed_message' => 'ვალიდაცია ვერ მოხერხდა. გთხოვთ შეამოწმოთ ქვემოთ მოცემული შეცდომები.',
        'no_data_message' => 'თქვენი მონაცემები უკვე განახლებულია ან არ არის მონაცემები იმპორტისთვის.',
    ],

    'export' => [
        'name' => 'ექსპორტი',
        'heading' => ':label ექსპორტი',
        'excel_not_supported_for_large_exports' => 'Excel ფორმატი არ არის მხარდაჭერილი დიდი ექსპორტებისთვის (:count ელემენტი). გთხოვთ გამოიყენოთ CSV ფორმატი უკეთესი შესრულებისა და საიმედოობისთვის.',

        'form' => [
            'all_columns_disabled' => 'ექსპორტირდება შემდეგი სვეტები: :columns.',
            'columns' => 'სვეტები',
            'format' => 'ფორმატი',
            'export_button' => 'ექსპორტი',
        ],

        'success_message' => 'წარმატებით ექსპორტირდა.',
        'error_message' => 'ექსპორტი ვერ მოხერხდა.',

        'empty_state' => [
            'title' => 'ექსპორტისთვის მონაცემები არ არის',
            'description' => 'როგორც ჩანს, ექსპორტისთვის მონაცემები არ არის.',
            'back' => 'დაბრუნება :page-ზე',
        ],
    ],
    'check_all' => 'ყველას მონიშვნა',
];
