<?php

return [
    'tools' => [
        'export_import_data' => 'डेटा निर्यात/आयात करें',
    ],

    'import' => [
        'name' => 'आयात',
        'heading' => ':label आयात करें',
        'failed_to_read_file' => 'फ़ाइल अमान्य, दूषित या पढ़ने के लिए बहुत बड़ी है।',

        'form' => [
            'quick_export_message' => 'यदि आप :label डेटा निर्यात करना चाहते हैं, तो आप :export_csv_link या :export_excel_link पर क्लिक करके इसे तुरंत कर सकते हैं।',
            'quick_export_button' => ':format में निर्यात करें',
            'dropzone_message' => 'फ़ाइल को यहाँ खींचें और छोड़ें या अपलोड करने के लिए क्लिक करें',
            'allowed_extensions' => 'निम्नलिखित एक्सटेंशन वाली फ़ाइल चुनें: :extensions।',
            'import_button' => 'आयात',
            'chunk_size' => 'चंक साइज़',
            'chunk_size_helper' => 'एक बार में आयात की जाने वाली पंक्तियों की संख्या चंक साइज़ द्वारा परिभाषित होती है। यदि आपके पास एक बड़ी फ़ाइल है और डेटा बहुत तेज़ी से आयात हो रहा है तो इस मान को बढ़ाएँ। डेटा आयात करते समय मेमोरी सीमा या गेटवे टाइमआउट समस्याओं का सामना करने पर इस मान को कम करें।',
        ],

        'failures' => [
            'title' => 'विफलताएं',
            'attribute' => 'विशेषता',
            'errors' => 'त्रुटियां',
        ],

        'example' => [
            'title' => 'उदाहरण',
            'download' => 'उदाहरण :type फ़ाइल डाउनलोड करें',
        ],

        'rules' => [
            'title' => 'नियम',
            'column' => 'कॉलम',
        ],

        'uploading_message' => 'फ़ाइल अपलोड करना शुरू हो रहा है...',
        'uploaded_message' => 'फ़ाइल :file सफलतापूर्वक अपलोड हो गई है। डेटा सत्यापन शुरू हो रहा है...',
        'validating_message' => ':from से :to तक सत्यापन हो रहा है...',
        'importing_message' => ':from से :to तक आयात हो रहा है...',
        'done_message' => 'सफलतापूर्वक :count :label आयात किया गया।',
        'validating_failed_message' => 'सत्यापन विफल रहा। कृपया नीचे दी गई त्रुटियों की जांच करें।',
        'no_data_message' => 'आपका डेटा पहले से ही अपडेट है या आयात करने के लिए कोई डेटा नहीं है।',
    ],

    'export' => [
        'name' => 'निर्यात',
        'heading' => ':label निर्यात करें',
        'excel_not_supported_for_large_exports' => 'Excel प्रारूप बड़े निर्यात (:count आइटम) के लिए समर्थित नहीं है। बेहतर प्रदर्शन और विश्वसनीयता के लिए कृपया CSV प्रारूप का उपयोग करें।',

        'form' => [
            'all_columns_disabled' => 'निम्नलिखित कॉलम निर्यात किए जाएंगे: :columns।',
            'columns' => 'कॉलम',
            'format' => 'प्रारूप',
            'export_button' => 'निर्यात',
        ],

        'success_message' => 'सफलतापूर्वक निर्यात किया गया।',
        'error_message' => 'निर्यात विफल रहा।',

        'empty_state' => [
            'title' => 'निर्यात करने के लिए कोई डेटा नहीं',
            'description' => 'ऐसा लगता है कि निर्यात करने के लिए कोई डेटा नहीं है।',
            'back' => ':page पर वापस जाएं',
        ],
    ],
    'check_all' => 'सभी को चेक करें',
];
