<?php

return [
    'tools' => [
        'export_import_data' => 'Экспорт/Импорт данных',
    ],

    'import' => [
        'name' => 'Импорт',
        'heading' => 'Импорт :label',
        'failed_to_read_file' => 'Файл недействителен, поврежден или слишком велик для чтения.',

        'form' => [
            'quick_export_message' => 'Если вы хотите экспортировать данные :label, вы можете быстро сделать это, нажав на :export_csv_link или :export_excel_link.',
            'quick_export_button' => 'Экспортировать в :format',
            'dropzone_message' => 'Перетащите файл сюда или нажмите для загрузки',
            'allowed_extensions' => 'Выберите файл со следующими расширениями: :extensions.',
            'import_button' => 'Импортировать',
            'chunk_size' => 'Размер порции',
            'chunk_size_helper' => 'Количество строк для импорта за один раз определяется размером порции. Увеличьте это значение, если у вас большой файл и данные импортируются очень быстро. Уменьшите это значение, если вы сталкиваетесь с ограничениями памяти или проблемами с таймаутом шлюза при импорте данных.',
        ],

        'failures' => [
            'title' => 'Ошибки',
            'attribute' => 'Атрибут',
            'errors' => 'Ошибки',
        ],

        'example' => [
            'title' => 'Пример',
            'download' => 'Скачать пример файла :type',
        ],

        'rules' => [
            'title' => 'Правила',
            'column' => 'Столбец',
        ],

        'uploading_message' => 'Начало загрузки файла...',
        'uploaded_message' => 'Файл :file успешно загружен. Начало проверки данных...',
        'validating_message' => 'Проверка от :from до :to...',
        'importing_message' => 'Импорт от :from до :to...',
        'done_message' => 'Успешно импортировано :count :label.',
        'validating_failed_message' => 'Проверка не удалась. Пожалуйста, проверьте ошибки ниже.',
        'no_data_message' => 'Ваши данные уже актуальны или нет данных для импорта.',
    ],

    'export' => [
        'name' => 'Экспорт',
        'heading' => 'Экспорт :label',
        'excel_not_supported_for_large_exports' => 'Формат Excel не поддерживается для больших экспортов (:count элементов). Пожалуйста, используйте формат CSV для лучшей производительности и надежности.',

        'form' => [
            'all_columns_disabled' => 'Будут экспортированы следующие столбцы: :columns.',
            'columns' => 'Столбцы',
            'format' => 'Формат',
            'export_button' => 'Экспортировать',
        ],

        'success_message' => 'Успешно экспортировано.',
        'error_message' => 'Экспорт не удался.',

        'empty_state' => [
            'title' => 'Нет данных для экспорта',
            'description' => 'Похоже, что нет данных для экспорта.',
            'back' => 'Назад к :page',
        ],
    ],
    'check_all' => 'Выбрать все',
];
