<?php

return [
    'tools' => [
        'export_import_data' => 'Експорт/імпорт даних',
    ],

    'import' => [
        'name' => 'Імпорт',
        'heading' => 'Імпорт :label',
        'failed_to_read_file' => 'Файл недійсний, пошкоджений або завеликий для читання.',

        'form' => [
            'quick_export_message' => 'Якщо ви хочете експортувати дані :label, ви можете швидко зробити це, натиснувши на :export_csv_link або :export_excel_link.',
            'quick_export_button' => 'Експортувати в :format',
            'dropzone_message' => 'Перетягніть файл сюди або натисніть, щоб завантажити',
            'allowed_extensions' => 'Виберіть файл з наступними розширеннями: :extensions.',
            'import_button' => 'Імпорт',
            'chunk_size' => 'Розмір блоку',
            'chunk_size_helper' => 'Кількість рядків, які потрібно імпортувати одночасно, визначається розміром блоку. Збільште це значення, якщо у вас великий файл і дані імпортуються дуже швидко. Зменшіть це значення, якщо під час імпортування даних виникнуть обмеження пам'яті або проблеми з тайм-аутом шлюзу.',
        ],

        'failures' => [
            'title' => 'Невдачі',
            'attribute' => 'Атрибут',
            'errors' => 'Помилки',
        ],

        'example' => [
            'title' => 'Приклад',
            'download' => 'Завантажити приклад :type файлу',
        ],

        'rules' => [
            'title' => 'Правила',
            'column' => 'Колонка',
        ],

        'uploading_message' => 'Початок завантаження файлу...',
        'uploaded_message' => 'Файл :file успішно завантажено. Початок перевірки даних...',
        'validating_message' => 'Перевірка від :from до :to...',
        'importing_message' => 'Імпорт від :from до :to...',
        'done_message' => 'Успішно імпортовано :count :label.',
        'validating_failed_message' => 'Помилка перевірки. Будь ласка, перевірте помилки нижче.',
        'no_data_message' => 'Ваші дані вже оновлені або немає даних для імпорту.',
    ],

    'export' => [
        'name' => 'Експорт',
        'heading' => 'Експорт :label',
        'excel_not_supported_for_large_exports' => 'Формат Excel не підтримується для великих експортів (:count елементів). Будь ласка, використовуйте формат CSV для кращої продуктивності та надійності.',

        'form' => [
            'all_columns_disabled' => 'Наступні колонки будуть експортовані: :columns.',
            'columns' => 'Колонки',
            'format' => 'Формат',
            'export_button' => 'Експорт',
        ],

        'success_message' => 'Успішно експортовано.',
        'error_message' => 'Помилка експорту.',

        'empty_state' => [
            'title' => 'Немає даних для експорту',
            'description' => 'Схоже, немає даних для експорту.',
            'back' => 'Назад до :page',
        ],
    ],
    'check_all' => 'Вибрати все',
];